#---------------------------------------------------------------------------------------------------
# 技能逻辑基类
# 逻辑简单的技能不需要继承此类，由 KsPlayer 通用逻辑处理
# 逻辑复杂的技能继承此类，重写对应方法
class_name KsSkillLogic_Base
#---------------------------------------------------------------------------------------------------
# 技能开始时调用（执行技能效果）
func OnSkillBegin(Player: KsPlayer, SkillData: KsTableSkill.SkillItem) -> void:
	pass
#---------------------------------------------------------------------------------------------------
# 技能持续期间每帧调用
func OnSkillUpdate(Player: KsPlayer, SkillData: KsTableSkill.SkillItem, Delta: float) -> void:
	pass
#---------------------------------------------------------------------------------------------------
# 技能结束时调用（清理效果）
func OnSkillEnd(Player: KsPlayer, SkillData: KsTableSkill.SkillItem) -> void:
	pass
#---------------------------------------------------------------------------------------------------
